START_MESSAGE = "«Якоря карьеры», — это ценностные ориентации, социальные установки, интересы и т.п. \
социально обусловленные побуждения к деятельности, характерные для определённого \
человека. Карьерные ориентации возникают в начальные годы развития карьеры, они \
устойчивы и могут оставаться стабильными длительное время. При этом очень часто человек \
реализует свои карьерные ориентации неосознанно. Тест позволяет выявить следующие \
карьерные ориентации: профессиональная компетентность, менеджмент, автономия, \
стабильность, служение, вызов, интеграция стилей жизни, предпринимательство."

TEST_HOW_IMPORTANT = """Насколько важным для Вас является каждое из следующих утверждений?
Варианты ответов: 1 – абсолютно не важно, 2, 3, 4, 5, 6, 7, 8, 9, 10 – исключительно важно"""

TEST_AGREEMENT_DEGREE = """Насколько Вы согласны с каждым из следующих утверждений?
Варианты ответов: 1 – совершенно не согласен, 2,3,4,5,6,7,8,9,10 – полностью согласен"""

PROFESSIONAL_COMPETENCE = """Быть профессионалом, мастером в своем деле. 
Эта ориентация связана с наличием способностей и талантов в определенной 
области. Люди с такой ориентацией хотят быть мастерами своего дела, они бывают 
особенно счастливы, когда достигают успеха в профессиональной сфере, но быстро 
теряют интерес к работе, которая не позволяет развивать их способности. Вряд ли 
их заинтересует даже значительно более высокая должность, если она не связана с 
их профессиональными компетенциями. Они ищут признания своих талантов, что 
должно выражаться в статусе, соответствующем их мастерству. Они готовы 
управлять другими в пределах своей компетенции, но управление не представляет 
для них особого интереса. Поэтому многие из этой категории отвергают работу 
руководителя, управление рассматривают как необходимое условие для 
продвижения в своей профессиональной сфере."""

MANAGEMENT = """Управлять – людьми, проектами, бизнес-процессами и т.п. 
Для этих людей первостепенное значение имеет ориентация личности на 
интеграцию усилий других людей, полнота ответственности за конечный результат 
и соединение различных функций организации. С возрастом и опытом эта 
карьерная ориентация проявляется сильнее. Возможности для лидерства, высокого 
дохода, повышенных уровней ответственности и вклад в успех своей организации 
являются ключевыми ценностями и мотивами. Самое главное для них – управление: 
людьми, проектами, любыми бизнес-процессами – это в целом не имеет 
принципиального значения. Центральное понятие их профессионального развития 
– власть, осознание того, что от них зависит принятие ключевых решений. Причем 
для них не является принципиальным управление собственным проектом или 
целым бизнесом, скорее наоборот, они в большей степени ориентированы на 
построение карьеры в наемном менеджменте, но при условии, что им будут 
делегированы значительные полномочия. Человек с такой ориентацией будет 
считать, что не достиг цели своей карьеры, пока не займет должность, на которой 
будет управлять различными сторонами деятельности предприятия."""

INDEPENDENCE = """Главное в работе – это свобода и независимость. 
Первичная забота личности с такой ориентацией – освобождение от 
организационных правил, предписаний и ограничений. Они испытывают 
трудности, связанные с установленными правилами, процедурами, рабочим днем, 
дисциплиной, формой одежды и т.д. Они любят выполнять работу своим способом, 
темпом и по собственным стандартам. Они не любят, когда работа вмешивается в 
их частную жизнь, поэтому предпочитают делать независимую карьеру 
собственным путем. Они скорее выберут низкосортную работу, чем откажутся от 
автономии и независимости. Для них первоочередная задача развития карьеры –
получить возможность работать самостоятельно, самому решать, как, когда и что 
делать для достижения тех или иных целей. Карьера для них – это, прежде всего, 
способ реализации их свободы, поэтому любые рамки и строгое подчинение 
оттолкнут их даже от внешне привлекательной вакансии. Такой человек может 
работать в организации, которая обеспечивает достаточную степень свободы."""

WORK_STABILITY = """Стабильная, надежная работа на длительное время 
Эти люди испытывают потребность в безопасности, защите и возможности 
прогнозирования и будут искать постоянную работу с минимальной вероятностью 
увольнения. Эти люди отождествляют свою работу со своей карьерой. Их 
потребность в безопасности и стабильности ограничивает выбор вариантов 
карьеры.
Авантюрные или краткосрочные проекты и только становящиеся на ноги компании 
их, скорее всего, не привлекают. Они очень ценят социальные гарантии, которые 
может предложить работодатель, и, как правило, их выбор места работы связан 
именно с длительным контрактом и стабильным положением компании на рынке. 
Такие люди ответственность за управление своей карьерой перекладывают на 
нанимателя.
Часто данная ценностная ориентация сочетается с невысоким уровнем притязаний."""

RESIDENCE_STABILITY = """Главное – жить в своем городе (минимум переездов, командировок).
Важнее остаться на одном месте жительства, чем получить повышение или новую 
работу на новой местности. Переезд для таких людей неприемлем, и даже частые 
командировки являются для них негативным фактором при рассмотрении 
предложения о работе."""

SERVICE = """Воплощать в работе свои идеалы и ценности.
Данная ценностная ориентация характерна для людей, занимающихся делом по 
причине желания реализовать в своей работе главные ценности. Они часто 
ориентированы больше на ценности, чем на требующиеся в данном виде работы 
способности. Они стремятся приносить пользу людям, обществу, для них очень 
важно видеть конкретные плоды своей работы, даже если они и не выражены в 
материальном эквиваленте. Основной тезис построения их карьеры – получить 
возможность максимально эффективно использовать их таланты и опыт для 
реализации общественно важной цели. Люди, ориентированные на служение, 
общительны и часто консервативны. Человек с такой ориентацией не будет 
работать в организации, которая враждебна его целям и ценностям."""

CHALLENGE = """Сделать невозможное – возможным, решать уникальные задачи.
Эти люди считают успехом преодоление непреодолимых препятствий, решение 
неразрешимых проблем или просто выигрыш. Они ориентированы на то, чтобы 
“бросать вызов”. Для одних людей вызов представляет более трудная работа, для 
других это — конкуренция и межличностные отношения. Они ориентированы на 
решение заведомо сложных задач, преодоление препятствий ради победы в 
конкурентной борьбе. Они чувствуют себя преуспевающими только тогда, когда 
постоянно вовлечены в решение трудных проблем или в ситуацию соревнования. 
Карьера для них – это постоянный вызов их профессионализму, и они всегда готовы 
его принять. Социальная ситуация чаще всего рассматривается с позиции 
“выигрыша – проигрыша”. Процесс борьбы и победа более важна для них, чем 
конкретная область деятельности или квалификация. Новизна,разнообразие и вызов 
имеют для них очень большую ценность, и, если все идет слишком просто, им 
становиться скучно."""

LIFE_STYLES_INTEGRATION = """Сохранение гармонии между сложившейся личной жизнью и карьерой.
Для людей этой категории карьера должна ассоциироваться с общим стилем жизни, 
уравновешивая потребности человека, семьи и карьеры. Они хотят, чтобы 
организационные отношения отражали бы уважение к их личным и семейным 
проблемам.
Выбирать и поддерживать определенный образ жизни для них важнее, чем 
добиваться успеха в карьере. Развитие карьеры их привлекает только в том случае, 
если она не нарушает привычный им стиль жизни и окружение. Для них важно, 
чтобы все было уравновешено – карьера, семья, личные интересы и т.п. Жертвовать 
чем-то одним ради другого им явно несвойственно.
Такие люди обычно в своем поведении проявляют конформность (тенденция 
изменять свое поведение в зависимости от влияния других людей, с тем, чтобы оно 
соответствовало мнению окружающих)"""

ENTREPRENEURSHIP = """Создавать новые организации, товары, услуги.
Этим людям нравится создавать новые организации, товары или услуги, которые 
могут быть отождествлены с их усилиями. Работать на других – это не их, они –
предприниматели по духу, и цель их карьеры – создать что-то новое, организовать 
свое дело, воплотить в жизнь идею, всецело принадлежащую только им. Вершина 
карьеры в их понимании – собственный бизнес.
"""

NO_CATEGORY = "Карьера не является центральной в жизни личности"